OdDAI.Utils.createCompressedGuidString(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,System.Int32)
\details
Creates the string representation of the GUID.
\param buf [out] A raw pointer to the data buffer that contains the string representation.
\param len [in] A usable length of the output buffer.
\returns
A pointer to the character buffer with the zero-terminated string representation of the GUID; otherwise, the function returns NULL.
\remarks
The buffer must be able to hold 22 characters + 1 for the terminating 0.

OdDAI.Utils.sdaiStrFTime(OdTimeStamp*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Prints contents of time stamp to string according to specified format.
\param timeStamp [in] A time stamp to print.
\param sFormat   [in] A string that contains the format.
\param str       [out] A string that contains the result.

OdDAI.Utils.getAggrLine(OdDAI.Aggr!System.Runtime.CompilerServices.IsConst*)
\details
Gets the aggregates`s value as string.
\param pAggr [in] Instance to get data from.
\returns An ANSI string that contains the aggregates`s value.

OdDAI.Utils.getStepLine(OdDAI.ApplicationInstance!System.Runtime.CompilerServices.IsConst*)
\details
Gets the instance`s ID, typename and values of the explicit attribute fields.
\param pInstance [in] Instance to get data from.
\returns An ANSI string that contains the instance`s ID, typename and value of the explicit attribute fields.